# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\adria\OneDrive\Documents\psoc\PROYECTO_IOT\DOMOTICA_PROYECTO.cydsn\DOMOTICA_PROYECTO.cyprj
# Date: Tue, 31 Oct 2023 15:41:06 GMT
#set_units -time ns
create_clock -name {Clock_3(routed)} -period 32249.999999999996 -waveform {0 16125} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_PC_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 81 161} -nominal_period 3333.333333333333 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {SPIM_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 121 241} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 775 1549} -nominal_period 32249.999999999996 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2401 4801} [list [get_pins {ClockBlock/dclk_glb_5}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\adria\OneDrive\Documents\psoc\PROYECTO_IOT\DOMOTICA_PROYECTO.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\adria\OneDrive\Documents\psoc\PROYECTO_IOT\DOMOTICA_PROYECTO.cydsn\DOMOTICA_PROYECTO.cyprj
# Date: Tue, 31 Oct 2023 15:40:55 GMT
