# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\GITHUB\Psoc_Projectos_propios\PWM_Motor_180dc\Workspace01\PWM_Motor_dc180.cydsn\PWM_Motor_dc180.cyprj
# Date: Fri, 01 Sep 2023 17:23:15 GMT
#set_units -time ns
create_clock -name {LED_Drive_ClkInternal(routed)} -period 833333.33333333326 -waveform {0 416666.666666667} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {LED_Drive_ClkInternal} -source [get_pins {ClockBlock/clk_sync}] -edges {1 20001 40001} -nominal_period 833333.33333333326 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2400001 4800001} [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\GITHUB\Psoc_Projectos_propios\PWM_Motor_180dc\Workspace01\PWM_Motor_dc180.cydsn\TopDesign\TopDesign.cysch
# Project: D:\GITHUB\Psoc_Projectos_propios\PWM_Motor_180dc\Workspace01\PWM_Motor_dc180.cydsn\PWM_Motor_dc180.cyprj
# Date: Fri, 01 Sep 2023 17:23:08 GMT
