# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\adria\OneDrive\Documents\psoc\Servo_s90\Servo_s90.cydsn\Servo_s90.cyprj
# Date: Sun, 03 Sep 2023 09:35:36 GMT
#set_units -time ns
create_clock -name {LED_Grados_ClkInternal(routed)} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 133 267} -nominal_period 5541.6666666666661 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {LED_Grados_ClkInternal} -source [get_pins {ClockBlock/clk_sync}] -edges {1 24001 48001} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 240001 480001} [list [get_pins {ClockBlock/dclk_glb_2}]]


# Component constraints for C:\Users\adria\OneDrive\Documents\psoc\Servo_s90\Servo_s90.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\adria\OneDrive\Documents\psoc\Servo_s90\Servo_s90.cydsn\Servo_s90.cyprj
# Date: Sun, 03 Sep 2023 09:35:33 GMT
